jmeter/results/master-only/report/statistics.json
{
  "GET /user/get/{id}" : {
    "transaction" : "GET /user/get/{id}",
    "sampleCount" : 6166,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 347.89750243269486,
    "medianResTime" : 409.0,
    "minResTime" : 0.0,
    "maxResTime" : 782.0,
    "pct1ResTime" : 502.0,
    "pct2ResTime" : 552.6499999999996,
    "pct3ResTime" : 684.3299999999999,
    "throughput" : 102.40313553551559,
    "receivedKBytesPerSec" : 23.818747482894057,
    "sentKBytesPerSec" : 17.50053585812034
  },
  "GET /user/search" : {
    "transaction" : "GET /user/search",
    "sampleCount" : 3650,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 659.1169863013702,
    "medianResTime" : 678.5,
    "minResTime" : 25.0,
    "maxResTime" : 1611.0,
    "pct1ResTime" : 961.0,
    "pct2ResTime" : 1022.4499999999998,
    "pct3ResTime" : 1231.9599999999991,
    "throughput" : 60.33855716458374,
    "receivedKBytesPerSec" : 170.27458176287774,
    "sentKBytesPerSec" : 14.427366170320044
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 9816,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 463.621943765283,
    "medianResTime" : 445.0,
    "minResTime" : 0.0,
    "maxResTime" : 1611.0,
    "pct1ResTime" : 822.0,
    "pct2ResTime" : 934.1499999999996,
    "pct3ResTime" : 1086.6599999999999,
    "throughput" : 162.26939099385044,
    "receivedKBytesPerSec" : 193.98347289207663,
    "sentKBytesPerSec" : 31.84718640481386
  }
}